# Rebar Update Curves Data Get Termination Rotation Angle Method

Source: https://www.revitapidocs.com/2026/8d559a4b-b58d-f8a3-1ce5-08e8e81e59f1.htm

---

| Rebar Update Curves Data Get Termination Rotation Angle Method |
| --- |

Gets the termination's (e.g hook, crank) rotation angle (in radians) at end that is currently in the rebar.
**Namespace:** Autodesk.Revit.DB.Structure
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public double GetTerminationRotationAngle(
	int end
)
```

```
Public Function GetTerminationRotationAngle (
	end As Integer
) As Double
```

```
public:
double GetTerminationRotationAngle(
	int end
)
```

```
member GetTerminationRotationAngle :
        end : int -> float
```

#### Parameters

end Int32
:   The end of bar. Should be 0 for start or 1 for end.

#### Return Value

Double
Returns the termination's (e.g hook, crank) rotation angle (in radians) at end that is currently in the rebar. Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | Invalid end. |

See Also

#### Reference

RebarUpdateCurvesData Class Autodesk.Revit.DB.Structure Namespace